# Вопросы и ответы
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какой оператор используется для суммирования?',
        'options': ['+', '-', '*', '/'],
        'correct_option': 0
    },
    {
        'question': 'Что такое API?',
        'options': ['Интерфейс прикладного программирования', 'Анализ производительности', 'Программа для обработки данных', 'Программный интерфейс к базе данных'],
        'correct_option': 0
    },
    {
        'question': 'Что такое фреймворк?',
        'options': ['Обработка данных', 'Структура для разработки приложений', 'Интерпретатор', 'Командная оболочка'],
        'correct_option': 1
    },
    {
        'question': 'Что такое HTML?',
        'options': ['Язык разметки', 'Язык программирования', 'База данных', 'Фреймворк'],
        'correct_option': 0
    },
    {
        'question': 'Какой язык используется для стилей?',
        'options': ['CSS', 'HTML', 'Java', 'XML'],
        'correct_option': 0
    },
    {
        'question': 'Что такое Git?',
        'options': ['Система контроля версий', 'Фреймворк', 'Язык программирования', 'Текстовый редактор'],
        'correct_option': 0
    },
    {
        'question': 'Что такое Docker?',
        'options': ['Платформа для виртуализации', 'Язык программирования', 'Система управления данными', 'Управляющая система'],
        'correct_option': 0
    },
    {
        'question': 'Что такое облачные технологии?',
        'options': ['Технологии удаленного хранения и обработки данных', 'Технологии программирования', 'Системы безопасности', 'Программные продукты'],
        'correct_option': 0
    }
]
